bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/i2s_reg.h
/**
  ******************************************************************************
  * @file    i2s_reg.h
  * @version V1.2
  * @date    2020-03-30
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2019 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __I2S_REG_H__
#define __I2S_REG_H__

#include "bl702l.h"

/* 0x0 : i2s_config */
#define I2S_CONFIG_OFFSET       (0x0)
#define I2S_CR_I2S_M_EN         I2S_CR_I2S_M_EN
#define I2S_CR_I2S_M_EN_POS     (0U)
#define I2S_CR_I2S_M_EN_LEN     (1U)
#define I2S_CR_I2S_M_EN_MSK     (((1U << I2S_CR_I2S_M_EN_LEN) - 1) << I2S_CR_I2S_M_EN_POS)
#define I2S_CR_I2S_M_EN_UMSK    (~(((1U << I2S_CR_I2S_M_EN_LEN) - 1) << I2S_CR_I2S_M_EN_POS))
#define I2S_CR_I2S_S_EN         I2S_CR_I2S_S_EN
#define I2S_CR_I2S_S_EN_POS     (1U)
#define I2S_CR_I2S_S_EN_LEN     (1U)
#define I2S_CR_I2S_S_EN_MSK     (((1U << I2S_CR_I2S_S_EN_LEN) - 1) << I2S_CR_I2S_S_EN_POS)
#define I2S_CR_I2S_S_EN_UMSK    (~(((1U << I2S_CR_I2S_S_EN_LEN) - 1) << I2S_CR_I2S_S_EN_POS))
#define I2S_CR_I2S_TXD_EN       I2S_CR_I2S_TXD_EN
#define I2S_CR_I2S_TXD_EN_POS   (2U)
#define I2S_CR_I2S_TXD_EN_LEN   (1U)
#define I2S_CR_I2S_TXD_EN_MSK   (((1U << I2S_CR_I2S_TXD_EN_LEN) - 1) << I2S_CR_I2S_TXD_EN_POS)
#define I2S_CR_I2S_TXD_EN_UMSK  (~(((1U << I2S_CR_I2S_TXD_EN_LEN) - 1) << I2S_CR_I2S_TXD_EN_POS))
#define I2S_CR_I2S_RXD_EN       I2S_CR_I2S_RXD_EN
#define I2S_CR_I2S_RXD_EN_POS   (3U)
#define I2S_CR_I2S_RXD_EN_LEN   (1U)
#define I2S_CR_I2S_RXD_EN_MSK   (((1U << I2S_CR_I2S_RXD_EN_LEN) - 1) << I2S_CR_I2S_RXD_EN_POS)
#define I2S_CR_I2S_RXD_EN_UMSK  (~(((1U << I2S_CR_I2S_RXD_EN_LEN) - 1) << I2S_CR_I2S_RXD_EN_POS))
#define I2S_CR_MONO_MODE        I2S_CR_MONO_MODE
#define I2S_CR_MONO_MODE_POS    (4U)
#define I2S_CR_MONO_MODE_LEN    (1U)
#define I2S_CR_MONO_MODE_MSK    (((1U << I2S_CR_MONO_MODE_LEN) - 1) << I2S_CR_MONO_MODE_POS)
#define I2S_CR_MONO_MODE_UMSK   (~(((1U << I2S_CR_MONO_MODE_LEN) - 1) << I2S_CR_MONO_MODE_POS))
#define I2S_CR_MUTE_MODE        I2S_CR_MUTE_MODE
#define I2S_CR_MUTE_MODE_POS    (5U)
#define I2S_CR_MUTE_MODE_LEN    (1U)
#define I2S_CR_MUTE_MODE_MSK    (((1U << I2S_CR_MUTE_MODE_LEN) - 1) << I2S_CR_MUTE_MODE_POS)
#define I2S_CR_MUTE_MODE_UMSK   (~(((1U << I2S_CR_MUTE_MODE_LEN) - 1) << I2S_CR_MUTE_MODE_POS))
#define I2S_CR_FS_1T_MODE       I2S_CR_FS_1T_MODE
#define I2S_CR_FS_1T_MODE_POS   (6U)
#define I2S_CR_FS_1T_MODE_LEN   (1U)
#define I2S_CR_FS_1T_MODE_MSK   (((1U << I2S_CR_FS_1T_MODE_LEN) - 1) << I2S_CR_FS_1T_MODE_POS)
#define I2S_CR_FS_1T_MODE_UMSK  (~(((1U << I2S_CR_FS_1T_MODE_LEN) - 1) << I2S_CR_FS_1T_MODE_POS))
#define I2S_CR_FS_4CH_MODE      I2S_CR_FS_4CH_MODE
#define I2S_CR_FS_4CH_MODE_POS  (7U)
#define I2S_CR_FS_4CH_MODE_LEN  (1U)
#define I2S_CR_FS_4CH_MODE_MSK  (((1U << I2S_CR_FS_4CH_MODE_LEN) - 1) << I2S_CR_FS_4CH_MODE_POS)
#define I2S_CR_FS_4CH_MODE_UMSK (~(((1U << I2S_CR_FS_4CH_MODE_LEN) - 1) << I2S_CR_FS_4CH_MODE_POS))
#define I2S_CR_FS_3CH_MODE      I2S_CR_FS_3CH_MODE
#define I2S_CR_FS_3CH_MODE_POS  (8U)
#define I2S_CR_FS_3CH_MODE_LEN  (1U)
#define I2S_CR_FS_3CH_MODE_MSK  (((1U << I2S_CR_FS_3CH_MODE_LEN) - 1) << I2S_CR_FS_3CH_MODE_POS)
#define I2S_CR_FS_3CH_MODE_UMSK (~(((1U << I2S_CR_FS_3CH_MODE_LEN) - 1) << I2S_CR_FS_3CH_MODE_POS))
#define I2S_CR_FRAME_SIZE       I2S_CR_FRAME_SIZE
#define I2S_CR_FRAME_SIZE_POS   (12U)
#define I2S_CR_FRAME_SIZE_LEN   (2U)
#define I2S_CR_FRAME_SIZE_MSK   (((1U << I2S_CR_FRAME_SIZE_LEN) - 1) << I2S_CR_FRAME_SIZE_POS)
#define I2S_CR_FRAME_SIZE_UMSK  (~(((1U << I2S_CR_FRAME_SIZE_LEN) - 1) << I2S_CR_FRAME_SIZE_POS))
#define I2S_CR_DATA_SIZE        I2S_CR_DATA_SIZE
#define I2S_CR_DATA_SIZE_POS    (14U)
#define I2S_CR_DATA_SIZE_LEN    (2U)
#define I2S_CR_DATA_SIZE_MSK    (((1U << I2S_CR_DATA_SIZE_LEN) - 1) << I2S_CR_DATA_SIZE_POS)
#define I2S_CR_DATA_SIZE_UMSK   (~(((1U << I2S_CR_DATA_SIZE_LEN) - 1) << I2S_CR_DATA_SIZE_POS))
#define I2S_CR_I2S_MODE         I2S_CR_I2S_MODE
#define I2S_CR_I2S_MODE_POS     (16U)
#define I2S_CR_I2S_MODE_LEN     (2U)
#define I2S_CR_I2S_MODE_MSK     (((1U << I2S_CR_I2S_MODE_LEN) - 1) << I2S_CR_I2S_MODE_POS)
#define I2S_CR_I2S_MODE_UMSK    (~(((1U << I2S_CR_I2S_MODE_LEN) - 1) << I2S_CR_I2S_MODE_POS))
#define I2S_CR_ENDIAN           I2S_CR_ENDIAN
#define I2S_CR_ENDIAN_POS       (18U)
#define I2S_CR_ENDIAN_LEN       (1U)
#define I2S_CR_ENDIAN_MSK       (((1U << I2S_CR_ENDIAN_LEN) - 1) << I2S_CR_ENDIAN_POS)
#define I2S_CR_ENDIAN_UMSK      (~(((1U << I2S_CR_ENDIAN_LEN) - 1) << I2S_CR_ENDIAN_POS))
#define I2S_CR_MONO_RX_CH       I2S_CR_MONO_RX_CH
#define I2S_CR_MONO_RX_CH_POS   (19U)
#define I2S_CR_MONO_RX_CH_LEN   (1U)
#define I2S_CR_MONO_RX_CH_MSK   (((1U << I2S_CR_MONO_RX_CH_LEN) - 1) << I2S_CR_MONO_RX_CH_POS)
#define I2S_CR_MONO_RX_CH_UMSK  (~(((1U << I2S_CR_MONO_RX_CH_LEN) - 1) << I2S_CR_MONO_RX_CH_POS))
#define I2S_CR_OFS_CNT          I2S_CR_OFS_CNT
#define I2S_CR_OFS_CNT_POS      (20U)
#define I2S_CR_OFS_CNT_LEN      (5U)
#define I2S_CR_OFS_CNT_MSK      (((1U << I2S_CR_OFS_CNT_LEN) - 1) << I2S_CR_OFS_CNT_POS)
#define I2S_CR_OFS_CNT_UMSK     (~(((1U << I2S_CR_OFS_CNT_LEN) - 1) << I2S_CR_OFS_CNT_POS))
#define I2S_CR_OFS_EN           I2S_CR_OFS_EN
#define I2S_CR_OFS_EN_POS       (25U)
#define I2S_CR_OFS_EN_LEN       (1U)
#define I2S_CR_OFS_EN_MSK       (((1U << I2S_CR_OFS_EN_LEN) - 1) << I2S_CR_OFS_EN_POS)
#define I2S_CR_OFS_EN_UMSK      (~(((1U << I2S_CR_OFS_EN_LEN) - 1) << I2S_CR_OFS_EN_POS))

/* 0x4 : i2s_int_sts */
#define I2S_INT_STS_OFFSET       (0x4)
#define I2S_TXF_INT              I2S_TXF_INT
#define I2S_TXF_INT_POS          (0U)
#define I2S_TXF_INT_LEN          (1U)
#define I2S_TXF_INT_MSK          (((1U << I2S_TXF_INT_LEN) - 1) << I2S_TXF_INT_POS)
#define I2S_TXF_INT_UMSK         (~(((1U << I2S_TXF_INT_LEN) - 1) << I2S_TXF_INT_POS))
#define I2S_RXF_INT              I2S_RXF_INT
#define I2S_RXF_INT_POS          (1U)
#define I2S_RXF_INT_LEN          (1U)
#define I2S_RXF_INT_MSK          (((1U << I2S_RXF_INT_LEN) - 1) << I2S_RXF_INT_POS)
#define I2S_RXF_INT_UMSK         (~(((1U << I2S_RXF_INT_LEN) - 1) << I2S_RXF_INT_POS))
#define I2S_FER_INT              I2S_FER_INT
#define I2S_FER_INT_POS          (2U)
#define I2S_FER_INT_LEN          (1U)
#define I2S_FER_INT_MSK          (((1U << I2S_FER_INT_LEN) - 1) << I2S_FER_INT_POS)
#define I2S_FER_INT_UMSK         (~(((1U << I2S_FER_INT_LEN) - 1) << I2S_FER_INT_POS))
#define I2S_CR_I2S_TXF_MASK      I2S_CR_I2S_TXF_MASK
#define I2S_CR_I2S_TXF_MASK_POS  (8U)
#define I2S_CR_I2S_TXF_MASK_LEN  (1U)
#define I2S_CR_I2S_TXF_MASK_MSK  (((1U << I2S_CR_I2S_TXF_MASK_LEN) - 1) << I2S_CR_I2S_TXF_MASK_POS)
#define I2S_CR_I2S_TXF_MASK_UMSK (~(((1U << I2S_CR_I2S_TXF_MASK_LEN) - 1) << I2S_CR_I2S_TXF_MASK_POS))
#define I2S_CR_I2S_RXF_MASK      I2S_CR_I2S_RXF_MASK
#define I2S_CR_I2S_RXF_MASK_POS  (9U)
#define I2S_CR_I2S_RXF_MASK_LEN  (1U)
#define I2S_CR_I2S_RXF_MASK_MSK  (((1U << I2S_CR_I2S_RXF_MASK_LEN) - 1) << I2S_CR_I2S_RXF_MASK_POS)
#define I2S_CR_I2S_RXF_MASK_UMSK (~(((1U << I2S_CR_I2S_RXF_MASK_LEN) - 1) << I2S_CR_I2S_RXF_MASK_POS))
#define I2S_CR_I2S_FER_MASK      I2S_CR_I2S_FER_MASK
#define I2S_CR_I2S_FER_MASK_POS  (10U)
#define I2S_CR_I2S_FER_MASK_LEN  (1U)
#define I2S_CR_I2S_FER_MASK_MSK  (((1U << I2S_CR_I2S_FER_MASK_LEN) - 1) << I2S_CR_I2S_FER_MASK_POS)
#define I2S_CR_I2S_FER_MASK_UMSK (~(((1U << I2S_CR_I2S_FER_MASK_LEN) - 1) << I2S_CR_I2S_FER_MASK_POS))
#define I2S_CR_I2S_TXF_EN        I2S_CR_I2S_TXF_EN
#define I2S_CR_I2S_TXF_EN_POS    (24U)
#define I2S_CR_I2S_TXF_EN_LEN    (1U)
#define I2S_CR_I2S_TXF_EN_MSK    (((1U << I2S_CR_I2S_TXF_EN_LEN) - 1) << I2S_CR_I2S_TXF_EN_POS)
#define I2S_CR_I2S_TXF_EN_UMSK   (~(((1U << I2S_CR_I2S_TXF_EN_LEN) - 1) << I2S_CR_I2S_TXF_EN_POS))
#define I2S_CR_I2S_RXF_EN        I2S_CR_I2S_RXF_EN
#define I2S_CR_I2S_RXF_EN_POS    (25U)
#define I2S_CR_I2S_RXF_EN_LEN    (1U)
#define I2S_CR_I2S_RXF_EN_MSK    (((1U << I2S_CR_I2S_RXF_EN_LEN) - 1) << I2S_CR_I2S_RXF_EN_POS)
#define I2S_CR_I2S_RXF_EN_UMSK   (~(((1U << I2S_CR_I2S_RXF_EN_LEN) - 1) << I2S_CR_I2S_RXF_EN_POS))
#define I2S_CR_I2S_FER_EN        I2S_CR_I2S_FER_EN
#define I2S_CR_I2S_FER_EN_POS    (26U)
#define I2S_CR_I2S_FER_EN_LEN    (1U)
#define I2S_CR_I2S_FER_EN_MSK    (((1U << I2S_CR_I2S_FER_EN_LEN) - 1) << I2S_CR_I2S_FER_EN_POS)
#define I2S_CR_I2S_FER_EN_UMSK   (~(((1U << I2S_CR_I2S_FER_EN_LEN) - 1) << I2S_CR_I2S_FER_EN_POS))

/* 0x10 : i2s_bclk_config */
#define I2S_BCLK_CONFIG_OFFSET (0x10)
#define I2S_CR_BCLK_DIV_L      I2S_CR_BCLK_DIV_L
#define I2S_CR_BCLK_DIV_L_POS  (0U)
#define I2S_CR_BCLK_DIV_L_LEN  (12U)
#define I2S_CR_BCLK_DIV_L_MSK  (((1U << I2S_CR_BCLK_DIV_L_LEN) - 1) << I2S_CR_BCLK_DIV_L_POS)
#define I2S_CR_BCLK_DIV_L_UMSK (~(((1U << I2S_CR_BCLK_DIV_L_LEN) - 1) << I2S_CR_BCLK_DIV_L_POS))
#define I2S_CR_BCLK_DIV_H      I2S_CR_BCLK_DIV_H
#define I2S_CR_BCLK_DIV_H_POS  (16U)
#define I2S_CR_BCLK_DIV_H_LEN  (12U)
#define I2S_CR_BCLK_DIV_H_MSK  (((1U << I2S_CR_BCLK_DIV_H_LEN) - 1) << I2S_CR_BCLK_DIV_H_POS)
#define I2S_CR_BCLK_DIV_H_UMSK (~(((1U << I2S_CR_BCLK_DIV_H_LEN) - 1) << I2S_CR_BCLK_DIV_H_POS))

/* 0x80 : i2s_fifo_config_0 */
#define I2S_FIFO_CONFIG_0_OFFSET   (0x80)
#define I2S_DMA_TX_EN              I2S_DMA_TX_EN
#define I2S_DMA_TX_EN_POS          (0U)
#define I2S_DMA_TX_EN_LEN          (1U)
#define I2S_DMA_TX_EN_MSK          (((1U << I2S_DMA_TX_EN_LEN) - 1) << I2S_DMA_TX_EN_POS)
#define I2S_DMA_TX_EN_UMSK         (~(((1U << I2S_DMA_TX_EN_LEN) - 1) << I2S_DMA_TX_EN_POS))
#define I2S_DMA_RX_EN              I2S_DMA_RX_EN
#define I2S_DMA_RX_EN_POS          (1U)
#define I2S_DMA_RX_EN_LEN          (1U)
#define I2S_DMA_RX_EN_MSK          (((1U << I2S_DMA_RX_EN_LEN) - 1) << I2S_DMA_RX_EN_POS)
#define I2S_DMA_RX_EN_UMSK         (~(((1U << I2S_DMA_RX_EN_LEN) - 1) << I2S_DMA_RX_EN_POS))
#define I2S_TX_FIFO_CLR            I2S_TX_FIFO_CLR
#define I2S_TX_FIFO_CLR_POS        (2U)
#define I2S_TX_FIFO_CLR_LEN        (1U)
#define I2S_TX_FIFO_CLR_MSK        (((1U << I2S_TX_FIFO_CLR_LEN) - 1) << I2S_TX_FIFO_CLR_POS)
#define I2S_TX_FIFO_CLR_UMSK       (~(((1U << I2S_TX_FIFO_CLR_LEN) - 1) << I2S_TX_FIFO_CLR_POS))
#define I2S_RX_FIFO_CLR            I2S_RX_FIFO_CLR
#define I2S_RX_FIFO_CLR_POS        (3U)
#define I2S_RX_FIFO_CLR_LEN        (1U)
#define I2S_RX_FIFO_CLR_MSK        (((1U << I2S_RX_FIFO_CLR_LEN) - 1) << I2S_RX_FIFO_CLR_POS)
#define I2S_RX_FIFO_CLR_UMSK       (~(((1U << I2S_RX_FIFO_CLR_LEN) - 1) << I2S_RX_FIFO_CLR_POS))
#define I2S_TX_FIFO_OVERFLOW       I2S_TX_FIFO_OVERFLOW
#define I2S_TX_FIFO_OVERFLOW_POS   (4U)
#define I2S_TX_FIFO_OVERFLOW_LEN   (1U)
#define I2S_TX_FIFO_OVERFLOW_MSK   (((1U << I2S_TX_FIFO_OVERFLOW_LEN) - 1) << I2S_TX_FIFO_OVERFLOW_POS)
#define I2S_TX_FIFO_OVERFLOW_UMSK  (~(((1U << I2S_TX_FIFO_OVERFLOW_LEN) - 1) << I2S_TX_FIFO_OVERFLOW_POS))
#define I2S_TX_FIFO_UNDERFLOW      I2S_TX_FIFO_UNDERFLOW
#define I2S_TX_FIFO_UNDERFLOW_POS  (5U)
#define I2S_TX_FIFO_UNDERFLOW_LEN  (1U)
#define I2S_TX_FIFO_UNDERFLOW_MSK  (((1U << I2S_TX_FIFO_UNDERFLOW_LEN) - 1) << I2S_TX_FIFO_UNDERFLOW_POS)
#define I2S_TX_FIFO_UNDERFLOW_UMSK (~(((1U << I2S_TX_FIFO_UNDERFLOW_LEN) - 1) << I2S_TX_FIFO_UNDERFLOW_POS))
#define I2S_RX_FIFO_OVERFLOW       I2S_RX_FIFO_OVERFLOW
#define I2S_RX_FIFO_OVERFLOW_POS   (6U)
#define I2S_RX_FIFO_OVERFLOW_LEN   (1U)
#define I2S_RX_FIFO_OVERFLOW_MSK   (((1U << I2S_RX_FIFO_OVERFLOW_LEN) - 1) << I2S_RX_FIFO_OVERFLOW_POS)
#define I2S_RX_FIFO_OVERFLOW_UMSK  (~(((1U << I2S_RX_FIFO_OVERFLOW_LEN) - 1) << I2S_RX_FIFO_OVERFLOW_POS))
#define I2S_RX_FIFO_UNDERFLOW      I2S_RX_FIFO_UNDERFLOW
#define I2S_RX_FIFO_UNDERFLOW_POS  (7U)
#define I2S_RX_FIFO_UNDERFLOW_LEN  (1U)
#define I2S_RX_FIFO_UNDERFLOW_MSK  (((1U << I2S_RX_FIFO_UNDERFLOW_LEN) - 1) << I2S_RX_FIFO_UNDERFLOW_POS)
#define I2S_RX_FIFO_UNDERFLOW_UMSK (~(((1U << I2S_RX_FIFO_UNDERFLOW_LEN) - 1) << I2S_RX_FIFO_UNDERFLOW_POS))
#define I2S_CR_FIFO_LR_MERGE       I2S_CR_FIFO_LR_MERGE
#define I2S_CR_FIFO_LR_MERGE_POS   (8U)
#define I2S_CR_FIFO_LR_MERGE_LEN   (1U)
#define I2S_CR_FIFO_LR_MERGE_MSK   (((1U << I2S_CR_FIFO_LR_MERGE_LEN) - 1) << I2S_CR_FIFO_LR_MERGE_POS)
#define I2S_CR_FIFO_LR_MERGE_UMSK  (~(((1U << I2S_CR_FIFO_LR_MERGE_LEN) - 1) << I2S_CR_FIFO_LR_MERGE_POS))
#define I2S_CR_FIFO_LR_EXCHG       I2S_CR_FIFO_LR_EXCHG
#define I2S_CR_FIFO_LR_EXCHG_POS   (9U)
#define I2S_CR_FIFO_LR_EXCHG_LEN   (1U)
#define I2S_CR_FIFO_LR_EXCHG_MSK   (((1U << I2S_CR_FIFO_LR_EXCHG_LEN) - 1) << I2S_CR_FIFO_LR_EXCHG_POS)
#define I2S_CR_FIFO_LR_EXCHG_UMSK  (~(((1U << I2S_CR_FIFO_LR_EXCHG_LEN) - 1) << I2S_CR_FIFO_LR_EXCHG_POS))
#define I2S_CR_FIFO_24B_LJ         I2S_CR_FIFO_24B_LJ
#define I2S_CR_FIFO_24B_LJ_POS     (10U)
#define I2S_CR_FIFO_24B_LJ_LEN     (1U)
#define I2S_CR_FIFO_24B_LJ_MSK     (((1U << I2S_CR_FIFO_24B_LJ_LEN) - 1) << I2S_CR_FIFO_24B_LJ_POS)
#define I2S_CR_FIFO_24B_LJ_UMSK    (~(((1U << I2S_CR_FIFO_24B_LJ_LEN) - 1) << I2S_CR_FIFO_24B_LJ_POS))

