bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/i2s_reg.h
/* 0x84 : i2s_fifo_config_1 */
#define I2S_FIFO_CONFIG_1_OFFSET (0x84)
#define I2S_TX_FIFO_CNT          I2S_TX_FIFO_CNT
#define I2S_TX_FIFO_CNT_POS      (0U)
#define I2S_TX_FIFO_CNT_LEN      (5U)
#define I2S_TX_FIFO_CNT_MSK      (((1U << I2S_TX_FIFO_CNT_LEN) - 1) << I2S_TX_FIFO_CNT_POS)
#define I2S_TX_FIFO_CNT_UMSK     (~(((1U << I2S_TX_FIFO_CNT_LEN) - 1) << I2S_TX_FIFO_CNT_POS))
#define I2S_RX_FIFO_CNT          I2S_RX_FIFO_CNT
#define I2S_RX_FIFO_CNT_POS      (8U)
#define I2S_RX_FIFO_CNT_LEN      (5U)
#define I2S_RX_FIFO_CNT_MSK      (((1U << I2S_RX_FIFO_CNT_LEN) - 1) << I2S_RX_FIFO_CNT_POS)
#define I2S_RX_FIFO_CNT_UMSK     (~(((1U << I2S_RX_FIFO_CNT_LEN) - 1) << I2S_RX_FIFO_CNT_POS))
#define I2S_TX_FIFO_TH           I2S_TX_FIFO_TH
#define I2S_TX_FIFO_TH_POS       (16U)
#define I2S_TX_FIFO_TH_LEN       (4U)
#define I2S_TX_FIFO_TH_MSK       (((1U << I2S_TX_FIFO_TH_LEN) - 1) << I2S_TX_FIFO_TH_POS)
#define I2S_TX_FIFO_TH_UMSK      (~(((1U << I2S_TX_FIFO_TH_LEN) - 1) << I2S_TX_FIFO_TH_POS))
#define I2S_RX_FIFO_TH           I2S_RX_FIFO_TH
#define I2S_RX_FIFO_TH_POS       (24U)
#define I2S_RX_FIFO_TH_LEN       (4U)
#define I2S_RX_FIFO_TH_MSK       (((1U << I2S_RX_FIFO_TH_LEN) - 1) << I2S_RX_FIFO_TH_POS)
#define I2S_RX_FIFO_TH_UMSK      (~(((1U << I2S_RX_FIFO_TH_LEN) - 1) << I2S_RX_FIFO_TH_POS))

/* 0x88 : i2s_fifo_wdata */
#define I2S_FIFO_WDATA_OFFSET (0x88)
#define I2S_FIFO_WDATA        I2S_FIFO_WDATA
#define I2S_FIFO_WDATA_POS    (0U)
#define I2S_FIFO_WDATA_LEN    (32U)
#define I2S_FIFO_WDATA_MSK    (((1U << I2S_FIFO_WDATA_LEN) - 1) << I2S_FIFO_WDATA_POS)
#define I2S_FIFO_WDATA_UMSK   (~(((1U << I2S_FIFO_WDATA_LEN) - 1) << I2S_FIFO_WDATA_POS))

/* 0x8C : i2s_fifo_rdata */
#define I2S_FIFO_RDATA_OFFSET (0x8C)
#define I2S_FIFO_RDATA        I2S_FIFO_RDATA
#define I2S_FIFO_RDATA_POS    (0U)
#define I2S_FIFO_RDATA_LEN    (32U)
#define I2S_FIFO_RDATA_MSK    (((1U << I2S_FIFO_RDATA_LEN) - 1) << I2S_FIFO_RDATA_POS)
#define I2S_FIFO_RDATA_UMSK   (~(((1U << I2S_FIFO_RDATA_LEN) - 1) << I2S_FIFO_RDATA_POS))

/* 0xFC : i2s_io_config */
#define I2S_IO_CONFIG_OFFSET     (0xFC)
#define I2S_CR_I2S_TXD_INV       I2S_CR_I2S_TXD_INV
#define I2S_CR_I2S_TXD_INV_POS   (0U)
#define I2S_CR_I2S_TXD_INV_LEN   (1U)
#define I2S_CR_I2S_TXD_INV_MSK   (((1U << I2S_CR_I2S_TXD_INV_LEN) - 1) << I2S_CR_I2S_TXD_INV_POS)
#define I2S_CR_I2S_TXD_INV_UMSK  (~(((1U << I2S_CR_I2S_TXD_INV_LEN) - 1) << I2S_CR_I2S_TXD_INV_POS))
#define I2S_CR_I2S_RXD_INV       I2S_CR_I2S_RXD_INV
#define I2S_CR_I2S_RXD_INV_POS   (1U)
#define I2S_CR_I2S_RXD_INV_LEN   (1U)
#define I2S_CR_I2S_RXD_INV_MSK   (((1U << I2S_CR_I2S_RXD_INV_LEN) - 1) << I2S_CR_I2S_RXD_INV_POS)
#define I2S_CR_I2S_RXD_INV_UMSK  (~(((1U << I2S_CR_I2S_RXD_INV_LEN) - 1) << I2S_CR_I2S_RXD_INV_POS))
#define I2S_CR_I2S_FS_INV        I2S_CR_I2S_FS_INV
#define I2S_CR_I2S_FS_INV_POS    (2U)
#define I2S_CR_I2S_FS_INV_LEN    (1U)
#define I2S_CR_I2S_FS_INV_MSK    (((1U << I2S_CR_I2S_FS_INV_LEN) - 1) << I2S_CR_I2S_FS_INV_POS)
#define I2S_CR_I2S_FS_INV_UMSK   (~(((1U << I2S_CR_I2S_FS_INV_LEN) - 1) << I2S_CR_I2S_FS_INV_POS))
#define I2S_CR_I2S_BCLK_INV      I2S_CR_I2S_BCLK_INV
#define I2S_CR_I2S_BCLK_INV_POS  (3U)
#define I2S_CR_I2S_BCLK_INV_LEN  (1U)
#define I2S_CR_I2S_BCLK_INV_MSK  (((1U << I2S_CR_I2S_BCLK_INV_LEN) - 1) << I2S_CR_I2S_BCLK_INV_POS)
#define I2S_CR_I2S_BCLK_INV_UMSK (~(((1U << I2S_CR_I2S_BCLK_INV_LEN) - 1) << I2S_CR_I2S_BCLK_INV_POS))
#define I2S_CR_DEG_CNT           I2S_CR_DEG_CNT
#define I2S_CR_DEG_CNT_POS       (4U)
#define I2S_CR_DEG_CNT_LEN       (3U)
#define I2S_CR_DEG_CNT_MSK       (((1U << I2S_CR_DEG_CNT_LEN) - 1) << I2S_CR_DEG_CNT_POS)
#define I2S_CR_DEG_CNT_UMSK      (~(((1U << I2S_CR_DEG_CNT_LEN) - 1) << I2S_CR_DEG_CNT_POS))
#define I2S_CR_DEG_EN            I2S_CR_DEG_EN
#define I2S_CR_DEG_EN_POS        (7U)
#define I2S_CR_DEG_EN_LEN        (1U)
#define I2S_CR_DEG_EN_MSK        (((1U << I2S_CR_DEG_EN_LEN) - 1) << I2S_CR_DEG_EN_POS)
#define I2S_CR_DEG_EN_UMSK       (~(((1U << I2S_CR_DEG_EN_LEN) - 1) << I2S_CR_DEG_EN_POS))

struct i2s_reg {
    /* 0x0 : i2s_config */
    union {
        struct
        {
            uint32_t cr_i2s_m_en    : 1; /* [    0],        r/w,        0x0 */
            uint32_t cr_i2s_s_en    : 1; /* [    1],        r/w,        0x0 */
            uint32_t cr_i2s_txd_en  : 1; /* [    2],        r/w,        0x0 */
            uint32_t cr_i2s_rxd_en  : 1; /* [    3],        r/w,        0x0 */
            uint32_t cr_mono_mode   : 1; /* [    4],        r/w,        0x0 */
            uint32_t cr_mute_mode   : 1; /* [    5],        r/w,        0x0 */
            uint32_t cr_fs_1t_mode  : 1; /* [    6],        r/w,        0x0 */
            uint32_t cr_fs_4ch_mode : 1; /* [    7],        r/w,        0x0 */
            uint32_t cr_fs_3ch_mode : 1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11  : 3; /* [11: 9],       rsvd,        0x0 */
            uint32_t cr_frame_size  : 2; /* [13:12],        r/w,        0x1 */
            uint32_t cr_data_size   : 2; /* [15:14],        r/w,        0x1 */
            uint32_t cr_i2s_mode    : 2; /* [17:16],        r/w,        0x0 */
            uint32_t cr_endian      : 1; /* [   18],        r/w,        0x0 */
            uint32_t cr_mono_rx_ch  : 1; /* [   19],        r/w,        0x0 */
            uint32_t cr_ofs_cnt     : 5; /* [24:20],        r/w,        0x0 */
            uint32_t cr_ofs_en      : 1; /* [   25],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } i2s_config;

    /* 0x4 : i2s_int_sts */
    union {
        struct
        {
            uint32_t i2s_txf_int     : 1;  /* [    0],          r,        0x0 */
            uint32_t i2s_rxf_int     : 1;  /* [    1],          r,        0x0 */
            uint32_t i2s_fer_int     : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3_7    : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t cr_i2s_txf_mask : 1;  /* [    8],        r/w,        0x1 */
            uint32_t cr_i2s_rxf_mask : 1;  /* [    9],        r/w,        0x1 */
            uint32_t cr_i2s_fer_mask : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_23  : 13; /* [23:11],       rsvd,        0x0 */
            uint32_t cr_i2s_txf_en   : 1;  /* [   24],        r/w,        0x1 */
            uint32_t cr_i2s_rxf_en   : 1;  /* [   25],        r/w,        0x1 */
            uint32_t cr_i2s_fer_en   : 1;  /* [   26],        r/w,        0x1 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } i2s_int_sts;

